routes/web.php

select * from `users` where `github_id` = 69880365 and `email` is null and `users`.`deleted_at` is null limit 1
---
});


Route::get('/auth/callback/github', function () {
    $githubUser = Socialite::driver('github')->user();

    $user = User::where('github_id', $githubUser->id)->first();
    if($user != null){
        $user->upload_id = uploads($githubUser->avatar,  $user->upload_id, 'general', 'url');
    }else{
        $user =new  User;
        $user->github_id = $githubUser->id;
        $user->password = Hash::make($githubUser->nickname. $githubUser->name);
        $user->upload_id = uploads($githubUser->avatar, null, 'general', 'url');
        if($githubUser->email != null){
            $user->email = $githubUser->email;
        }
        $user->name = $githubUser->name;
        $user->username = $githubUser->nickname.time();
    }
    $user->github_token = $githubUser->token;
    $user->github_refresh_token = $githubUser->refreshToken;
    $user->save();


select * from `users` where `email` = 'mdsazzad0002@gmail.com' and `users`.`deleted_at` is null limit 1
---
    $request_data =  $_GET;


    $user = User::where('email', $request_data['email'])->first();

update `users` set `username` = 'md-sazzad-sarkar1724270194', `users`.`updated_at` = '2024-08-21 19:56:34' where `id` = 19
---
        $user->username = Str::slug($request_data['name']) . time();

    }
    $user->save();

select * from `posts` where `posts`.`deleted_at` is null
---


//One User and guest Post create
Route::prefix('user-post')
        ->middleware('web')
        ->name('user-post.')
        ->group(function() {
            Route::get('/post', [postManageController::class, 'create'])->name('post.create');
            Route::post('/post', [postManageController::class, 'store'])->name('post.store');
            Route::get('/post/{post}/edit', [postManageController::class, 'edit'])->name('post.edit');
            Route::put('/post/{post}', [postManageController::class, 'update'])->name('post.update');
            Route::get('/post/{post}', [postManageController::class, 'show'])->name('post.show');
            Route::get('/post/comment/{id}', [postManageController::class, 'comment'])->name('post.comment');
});

select * from `users` where `users`.`deleted_at` is null
---


//One User and guest Job Post create
Route::prefix('user-job-post')
        ->middleware('web')
        ->name('user-job-post.')
        ->group(function() {
            Route::get('/job-apply/{id}', [JobPostManageController::class, 'apply'])->name('job-post.apply');
            Route::post('/job-apply', [JobPostManageController::class, 'apply_store'])->name('job-post.apply_store');
            Route::get('/holderSelected/{id}', [JobPostManageController::class, 'holderSelected'])->name('job-post.holderSelected');
            Route::get('/cv/{name}', [JobPostManageController::class, 'cvshow'])->name('job-post.cv');



            Route::get('/job-post', [JobPostManageController::class, 'create'])->name('job-post.create');
            Route::post('/job-post', [JobPostManageController::class, 'store'])->name('job-post.store');
            Route::get('/job-post/{post}/edit', [JobPostManageController::class, 'edit'])->name('job-post.edit');
            Route::put('/job-post/{post}', [JobPostManageController::class, 'update'])->name('job-post.update');
            Route::get('/job-post/{post}', [JobPostManageController::class, 'show'])->name('job-post.show');
            Route::get('/job-post/comment/{id}', [JobPostManageController::class, 'comment'])->name('job-post.comment');
});