routes/web.php

select * from `posts` where `subcategory_id` = 6 and `category_id` = 1 and `posts`.`deleted_at` is null
---


// Sitemap
Route::get('/sitemap', function () {
    $sitemap = Sitemap::create(config('app.url'))
    ->add(Url::create('/'));
    $sitemap = Sitemap::create(config('app.url'))
    ->add(Url::create('/category'));
    // ->add(Url::create(''))

    category::all()->each(function (category $category) use ($sitemap) {
        $sitemap->add(Url::create("category/{$category->slug}")
        ->setLastModificationDate($category->updated_at));

        subcategory::where('category_id', $category->id)->get()->each(function ($subcategory) use ($sitemap , $category) {
            $sitemap->add(Url::create("category/{$category->slug}/subcategory/{$subcategory->slug}")
            ->setLastModificationDate($subcategory->updated_at));
            $sitemap->add(Url::create("subcategory/{$subcategory->id}/{$subcategory->slug}")
            ->setLastModificationDate($subcategory->updated_at));


            Post::where('subcategory_id', $subcategory->id)->where('category_id', $category->id)->get()->each(function (Post $post) use ($sitemap, $category, $subcategory) {
                $sitemap->add(Url::create("category/{$category->slug}/subcategory/{$subcategory->slug}/{$post->slug}")
                ->setLastModificationDate($post->updated_at));