app/Http/Controllers/profile/profileController.php

    public function chosencategory(Request $request){
        if(auth()->user() && auth()->user()->username == $request->id){
            $choosen_category = $request->choosen_category;
            if(is_array($choosen_category)){
                $category = implode(',', $choosen_category);

                $user_find = User::where('username', $request->id)->first();
---
select * from `users` where `username` = 'superadmin' and `users`.`deleted_at` is null limit 1