app/Http/Controllers/profile/ViewProfileController.php

    public function index($id){
        if($id != null && !empty($id)){
             $user = User::where('username', $id)->get()->first();
---
select * from `users` where `username` = 'md-sazzad-sarkar1724509348' and `users`.`deleted_at` is null



                 // job report  profile dashboard
                  $job_for_report = JobPost::whereBetween('updated_at', [$date_range, $date_today])
                                                ->where('creatorId', $user->id)
                                                ->select(DB::raw('COUNT(*) AS votes_items'),DB::raw('DATE(updated_at) AS date'))
                                                ->groupBy('date')
                                                ->pluck( 'votes_items','date')
                                                ->toArray();
---
select COUNT(*) AS votes_items, DATE(updated_at) AS date from `job_posts` where `updated_at` between '2024-08-05 16:10:41' and '2024-09-04 16:10:41' and `creatorId` = 19 group by `date`