app/Http/Controllers/profile/ViewProfileController.php

select * from `users` where `username` = 'md-sazzad-sarkar1724262905' and `users`.`deleted_at` is null
---
    public function index($id){
        if($id != null && !empty($id)){
             $user = User::where('username', $id)->get()->first();

select * from `users` where `username` = 'superadmin' and `users`.`deleted_at` is null
---
    public function comment($id){
        if($id != null && !empty($id)){
             $user = User::where('username', $id)->get()->first();

select * from `users` where `username` = 'superadmin' and `users`.`deleted_at` is null
---
    public function post($id){
        if($id != null && !empty($id)){
             $user = User::where('username', $id)->get()->first();

select * from `users` where `username` = 'superadmin' and `users`.`deleted_at` is null
select * from `job_posts` where `creatorId` = 1 order by `id` desc limit 30 offset 0
select count(*) as aggregate from `job_posts` where `creatorId` = 1
---
    public function job($id){
        if($id != null && !empty($id)){
             $user = User::where('username', $id)->get()->first();
            if($user){
                $posts = JobPost::where('creatorId', $user->id)->orderBy('id','desc')->paginate(30);

select * from `job_applies` where `job_post_id` = '2'
---
    public function list_selected($id){

        $list_applied_list = JobApply::where('job_post_id', $id)->get();