app/helper/helper.php

select `title` from `general_settings` where `key` = 'sandbox_status'
---
function general_setting($key){
    $value = GeneralSetting::where('key', $key)->select('title')->get()->first();

select * from `job_posts` where (`category_id` LIKE '%1%' or `category_id` LIKE '%2%' or `category_id` LIKE '%3%' or `category_id` LIKE '%4%' or `category_id` LIKE '%5%' or `category_id` LIKE '%6%' or `category_id` LIKE '%7%' or `category_id` LIKE '%8%' or `category_id` LIKE '%9%') and `deadline` >= '2024-08-24 16:58:21' order by RAND() limit 1
select * from `job_posts` where `deadline` >= '2024-09-07 15:57:03' order by RAND() limit 15
select * from `job_posts` where `deadline` >= '2024-09-07 16:21:26' and `category_id` LIKE '%1%' order by RAND() limit 15
---
function jobPost($cat_id = null, $items = 1){
        $job_post = [];
        $today = \Carbon\Carbon::now();
        if($cat_id == null){
            if(auth()->user()){
                $job_post = JobPost::where(function ($query){
                    if(auth()->user()->chosen_category !=null){
                        $category_data = explode(',', auth()->user()->chosen_category);
                        foreach ($category_data as $key => $value) {
                            $query->orWhere('category_id',  'LIKE', '%'.$value.'%');
                        }
                    }
                })->where('deadline', '>=', $today)->inRandomOrder()->limit($items)->get();
            }else{

                $job_post = JobPost::where('deadline', '>=', $today)->inRandomOrder()->limit($items)->get();
            }
        }else{
        $cat_id = category::where('slug', $cat_id)->first();
            if($cat_id){
                $cat_id = $cat_id->id;
                $job_post = JobPost::where('deadline', '>=', $today)->where('category_id',  'LIKE', '%'.$cat_id.'%')->inRandomOrder()->limit($items)->get();
            }else{
                $job_post = JobPost::where('deadline', '>=', $today)->where('category_id',  'LIKE', '%'.$cat_id.'%')->inRandomOrder()->limit($items)->get();