app/helper/helper.php

insert into `uploads` (`name`, `external`, `extension`, `size`, `creator_id`, `for`, `old_name`, `updated_at`, `created_at`) values ('', 'https://avatars.githubusercontent.com/u/69880365?v=4', 'https://avatars', 0, 0, 'general', 'https://avatars.githubusercontent.com/u/69880365?v=4', '2024-08-21 16:25:44', '2024-08-21 16:25:44')
---
function uploads($file, $id = null, $for = 'general')
{
    $file_extension = $file->getClientOriginalExtension();
    $file_name = (rand (1000,100000).time() * 40202) . '.' . $file_extension;

    $file_temp_name  =  $file->getRealPath();
    $orginalname = $file->getClientOriginalName();
    $file_size = $file->getSize();

    $file_mime_type = $file->getMimeType();
    $file_mime_type = explode('/', $file_mime_type)[0];

    if (file_type($file_mime_type, $file_extension)) {
        $destinationPath = public_path() . '/uploads/';
        $file->move($destinationPath, $file_name);
        if ($id != null) {
            $file_find = uploads::find($id);
            if ($file_find) {
                if (file_exists($destinationPath . $file_find->name)) {
                    unlink($destinationPath . $file_find->name);
                }
                $file_find->name = $file_name;
                $file_find->extension = $file_extension;
                $file_find->size = $file_size;
                $file_find->save();
            } else {
                uploads::create([
                    'name' => $file_name,
                    'extension' => $file_extension,
                    'size' => $file_size,
                    'creator_id'=>auth()->user()->id ?? 0,
                    'for'=>$for,
                    'old_name'=> $orginalname
                ]);

select `title` from `general_settings` where `key` = 'fav_logo'
---
function general_setting($key){
    $value = GeneralSetting::where('key', $key)->select('title')->get()->first();

select * from `job_posts` where (`category_id` LIKE '%1%' or `category_id` LIKE '%2%' or `category_id` LIKE '%8%' or `category_id` LIKE '%9%') and `deadline` >= '2024-08-21 13:51:56' order by RAND() limit 15
select * from `job_posts` where `deadline` >= '2024-08-21 17:11:33' order by RAND() limit 15
select * from `job_posts` where `deadline` >= '2024-08-21 14:09:46' and `category_id` LIKE '%3%' order by RAND() limit 15
---
function jobPost($cat_id = null, $items = 1){
        $job_post = [];
        $today = \Carbon\Carbon::now();
        if($cat_id == null){
            if(auth()->user()){
                $job_post = JobPost::where(function ($query){
                    if(auth()->user()->chosen_category !=null){
                        $category_data = explode(',', auth()->user()->chosen_category);
                        foreach ($category_data as $key => $value) {
                            $query->orWhere('category_id',  'LIKE', '%'.$value.'%');
                        }
                    }
                })->where('deadline', '>=', $today)->inRandomOrder()->limit($items)->get();
            }else{

                $job_post = JobPost::where('deadline', '>=', $today)->inRandomOrder()->limit($items)->get();
            }
        }else{
        $cat_id = category::where('slug', $cat_id)->first();
            if($cat_id){
                $cat_id = $cat_id->id;
                $job_post = JobPost::where('deadline', '>=', $today)->where('category_id',  'LIKE', '%'.$cat_id.'%')->inRandomOrder()->limit($items)->get();