app/Http/Controllers/frontend/DetailsController.php

    public function single_items($id=null, $slug =null)
    {

        if($slug == null){
            $slug = $id;
        }
        $view_post = post::where('slug', $slug)->get()->first();
        if ($view_post) {
            $subcategory_id =  subcategory::where('id', $view_post->subcategory_id)->get()->first();
            if ($subcategory_id) {
                $post_list_menu =  post::where('subcategory_id', $subcategory_id->id)->select('slug', 'tilte')->get();
                $subcategory = $subcategory_id->slug;
                $category = Category::where('id', $subcategory_id->category_id)->get()->first();
---
select * from `categories` where `id` = 3 and `categories`.`deleted_at` is null
select * from `subcategories` where `id` = 6 and `subcategories`.`deleted_at` is null
select * from `categories` where `id` = 1 and `categories`.`deleted_at` is null