app/Http/Controllers/frontend/FeedController.php

     public function index()
    {
        $category = category::where('status', 1)->paginate(15);
        $contribute_data = User::withCount(['votes', 'comments', 'posts'])
            ->whereHas('votes', function ($query) {
                $query->where('user_id', '!=', 0);
            })
            ->oRwhereHas('comments', function ($query) {
                $query->where('user_id', '!=', 0);
            })
            ->oRwhereHas('posts', function ($query) {
                $query->where('user_id', '!=', 0);
            })
            ->orderBy('posts_count', 'desc')
            ->orderBy('comments_count', 'desc')
            ->orderBy('votes_count', 'desc')
            ->get();
---
select `users`.*, (select count(*) from `votes` where `users`.`id` = `votes`.`user_id`) as `votes_count`, (select count(*) from `comments` where `users`.`id` = `comments`.`user_id`) as `comments_count`, (select count(*) from `posts` where `users`.`id` = `posts`.`user_id` and `posts`.`deleted_at` is null) as `posts_count` from `users` where (exists (select * from `votes` where `users`.`id` = `votes`.`user_id` and `user_id` != 0) or exists (select * from `comments` where `users`.`id` = `comments`.`user_id` and `user_id` != 0) or exists (select * from `posts` where `users`.`id` = `posts`.`user_id` and `user_id` != 0 and `posts`.`deleted_at` is null)) and `users`.`deleted_at` is null order by `posts_count` desc, `comments_count` desc, `votes_count` desc