app/Http/Controllers/frontend/HomeController.php

select * from `banners` where `status` = 1
---
    public function index()
    {

        $banner = Banner::where('status', 1)->get();

select `title` as `tilte`, `short_details`, `slug` from `job_posts` where `status` = 1 and `title` LIKE '%sa%' or `short_details` LIKE '%sa%' or `long_details` LIKE '%sa%' or `company_name` LIKE '%sa%' or `company_type` LIKE '%sa%' or `location` LIKE '%sa%' and `deadline` >= '2024-08-21 05:06:08' limit 8
select `tilte`, `short_details`, `slug`, `uploads_id` from `posts` where (`status` = 1 and `tilte` LIKE '%fs%' or `short_details` LIKE '%fs%' or `details` LIKE '%fs%') and `posts`.`deleted_at` is null limit 8
---
    public function get_data_search(Request $request){
        // return $request;
        $now = \Carbon\Carbon::now();
        if(isset($request->query_data)){

            $post = post::where('status', 1)
                    ->where('tilte','LIKE','%'. $request->query_data.'%')
                    ->orWhere('short_details' ,'LIKE','%'.$request->query_data.'%')
                    ->orWhere('details','LIKE','%'.$request->query_data.'%')
                    ->select('tilte', 'short_details','slug','uploads_id')
                    ->limit(8)
                    ->get();

            $job = JobPost::where('status', 1)
                    ->where(function($query) use ($request){
                        $query->where('title','LIKE','%'. $request->query_data.'%');
                        $query->orWhere('short_details' ,'LIKE','%'.$request->query_data.'%');
                        $query->orWhere('long_details','LIKE','%'.$request->query_data.'%');
                        $query->orWhere('company_name','LIKE','%'.$request->query_data.'%');
                        $query->orWhere('company_type','LIKE','%'.$request->query_data.'%');
                        $query->orWhere('location','LIKE','%'.$request->query_data.'%');

                    })
                    ->where('deadline','>=',$now)
                    ->select('title as tilte', 'short_details','slug')
                    ->limit(8)
                    ->get();