app/Http/Controllers/frontend/jobpostcontroller.php

select * from `job_posts` where `slug` = 'soluta-deleniti-pari2024-08-19-115808' limit 1
---
    public function index($slug){

        if ($slug) {
            $category = category::where('status', 1)->get();
            $job_details = JobPost::where('slug', $slug)->first();