app/Http/Controllers/JobPostManageController.php

    public function create(){
        $category = category::where('status', 1)->select('id','name')->get();
        $district = District::where('status', 1)->select('id','name')->get();
---
select `id`, `name` from `districts` where `status` = 1


        $slug = Str::slug($request->title.Carbon::now()->toDateTimeString() ?? Carbon::now()->toDateTimeString(), '-');
        $post->slug = $slug ?? '';
        $post->save();
---
insert into `job_posts` (`long_details`, `title`, `creatorId`, `short_details`, `district_id`, `category_id`, `start_date`, `deadline`, `company_name`, `company_type`, `location`, `slug`, `updated_at`, `created_at`) values ('sdsd', 'Soluta deleniti pari', 1, 'Sed ipsum aliqua Es', '1', '6,9', '2018-01-27', '2003-03-11', 'Wilkerson Thomas Plc', 'Hood and Bird Inc', 'Repellendus Ex eu o', 'soluta-deleniti-pari2024-08-19-115808', '2024-08-19 11:58:08', '2024-08-19 11:58:08')

    public function apply($id){
        if(auth()->user()){

            $jobPost = JobPost::find($id);
---
select * from `job_posts` where `job_posts`.`id` = '2' limit 1

    public function apply_store(Request $request){
        // return $request;
        if(auth()->user()){
            $creator_id = auth()->user()->id;
            $post_find = JobPost::find($request->post_id);
            if($post_find){
                $job_apply_find = JobApply::where('job_post_id', $request->post_id)->where('creator_id', $creator_id)->first();
---
select * from `job_applies` where `job_post_id` = '2' and `creator_id` = 1 limit 1