app/Models/JobPost.php

    public function categoryname(){
        $data = [];
        if($this->category_id != null){
            $data = explode(',', $this->category_id);
            $data = category::whereIn('id', $data)->get();
---
select * from `categories` where `id` in ('2', '3', '4', '5', '6', '9') and `categories`.`deleted_at` is null