app/Models/User.php

   public function chosen_category(){
        $category = $this->chosen_category;
        if($category != null){
            $category = explode(',', $category);
            return category::whereIn('id', $category)->get();
---
select * from `categories` where `id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9') and `categories`.`deleted_at` is null