app/Http/Controllers/backend/JobPostController.php

    public function show(string $id)
    {
        $post = JobPost::find($id);
---
select * from `job_posts` where `job_posts`.`id` = '2' limit 1

    public function show1(string $id)
    {
        $post = JobApply::find($id);
---
select * from `job_applies` where `job_applies`.`id` = '1' limit 1