app/Http/Controllers/backend/ReportController.php

    public function update(Request $request, string $id)
    {
        $report = Report::find($id);
---
select * from `reports` where `reports`.`id` = '2' limit 1